config/InformationRegisters/РезервПодбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РезервПодбора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/CommonModules/ОМ15_РезервПодбора/Ext/Module.bsl
#Если Клиент Тогда
	//============================================================================ GtG ===
	Функция ОМ15_ОчисткаРезерваДокумента  (Док = неопределено, ПолнаяОчистка=Ложь) Экспорт
		//
		//Удаляет из регистра РезервПодбора все записи сделанные
		//указанным документом
		//Запускаем при проведении документа делающего резерв товара
		//и перед удалением такого документа
		//---------------------------------------------------------------------
		
		
		
		
		//
		//РП=РегистрыСведений.РезервПодбора.Выбрать();
		//
		//
		//
		//
		//
		//Пока РП.Следующий() Цикл
		//	МЗ=РП.ПолучитьМенеджерЗаписи();
		//	Если (ПолнаяОчистка=Ложь И МЗ.Документ=Док) или (ПолнаяОчистка=Истина) тогда
		//		МЗ.Удалить();
		//	КонецЕсли; 	
		//КонецЦикла;	
		
		
		Если ПолнаяОчистка=Истина Тогда 
			НаборЗаписей = РегистрыСведений.РезервПодбора.СоздатьНаборЗаписей();
			НаборЗаписей.Записать();		
		Иначе
			НаборЗаписей = РегистрыСведений.РезервПодбора.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Док);
			НаборЗаписей.Записать();				
		КонецЕсли;
	
	КонецФункции
	//============================================================================ GtG ===
#КонецЕсли



#Если Клиент Тогда
	//============================================================================ GtG ===
Функция ОМ15_ДобавитьСтрокуРезерваПодбора  (Товар,Партия,Склад,Колво,Док) Экспорт
		
		//============================< Резерв подбора >================================GtG=== 
		МРП=РегистрыСведений.РезервПодбора.СоздатьМенеджерЗаписи();
		
		МРП.ТОвар=Товар;
		МРП.Партия=Партия;
		МРП.Склад=Склад;
		МРП.Количество= Колво;
		МРП.Документ=Док;
		
		МРП.Записать();
		//========================================================================GtG====КОНЕЦ
 КонецФункции
#КонецЕсли

#Если Клиент Тогда
	//============================================================================ GtG ===
Функция ОМ15_ИзменитьСтрокуРезерваПодбора  (Товар,Партия,Склад,Колво,Док) Экспорт
		
		//============================< Резерв подбора >================================GtG=== 
		
		РП=РегистрыСведений.РезервПодбора.Выбрать(Новый Структура("Документ",Док));
		
		Пока РП.Следующий() Цикл
			
			ЕСли РП.ТОвар=ТОвар
				И РП.Партия=Партия
				И РП.Склад=Склад
				И РП.Документ= Док
				ТОгда
					МРП=РП.ПолучитьМенеджерЗаписи();
					МРП.Количество=Колво;
					Мрп.Записать();
				КонецЕсли;
		КонецЦикла;		
		//========================================================================GtG====КОНЕЦ
 КонецФункции
#КонецЕсли


#Если Клиент Тогда

Процедура ОМ15_УдалитьСтрокуДокИзРезерваПодбора (Товар,Партия,Склад,Док)  Экспорт
	//----------------------------------
	//Назначение:
	//  Удаляет строку документа из резерва подбора
	//  использовать при удалении строки документа чтобы
	//  освободтиь товар от резерва. Пихать во все документы.
	//                                        // GtG 14.11.2007 23:56:19
	//----------------------------------
	
	
	
	РП=РегистрыСведений.РезервПодбора.Выбрать(Новый Структура("Документ",Док));
		
		Пока РП.Следующий() Цикл
			
			ЕСли РП.ТОвар=ТОвар
				И РП.Партия=Партия
				И РП.Склад=Склад
				И РП.Документ= Док
				ТОгда
					МРП=РП.ПолучитьМенеджерЗаписи();
					МРП.Удалить();
				КонецЕсли;
		КонецЦикла;	
	
	
	
	
КонецПроцедуры	//ОМ15_УдалитьСтрокуДокИзРезерваПодбора
#КонецЕсли

//==========================================================GtG====
Процедура ОМ15_ДобавитьДокументЦеликомВРезервПодбора (Док,ПартияСтарая="")  Экспорт
	//----------------------------------
	//Назначение:
	//  Добавляет весь товар из документа в резевр подбора
	//  Использовать при снятии пометки удаления с документа, по которому должен резервироваться товар
	//  Типа как буд-то его заново весь набрали
	//                            // GtG 15.11.2007 1:58:43 
	// Во всех документах, которые сюда буду тпередаваться ДОЛЖНА БЫТЬ табличная часть
	// называемая ТОВАР и она должна иметь колонки:
	//  Товар,Партия,Склад(берем из шапки документа),Место,КоличествоФакт
	// На момент передачи в эту процедуру документ должен быть записан
	//----------------------------------
	
	ИмяДок=Док.Метаданные().ПолноеИмя();
	Если ПартияСтарая = "ПартияСтарая" Тогда
		
		ТХТ="ВЫБРАТЬ
		|	Док_Товар.ТоварСтарый,
		|	Док_Товар.ПартияСтарая,
		|	Док_Товар.Ссылка.Склад как склад,
		|	Док_Товар.КоличествоФакт
		|ИЗ
		|	"+ИмяДок+".Товар КАК Док_Товар
		|Где Док_Товар.Ссылка=&Док";
	ИНаче		
		
		ТХТ="ВЫБРАТЬ
		|	Док_Товар.Товар,
		|	Док_Товар.Партия,
		|	Док_Товар.Ссылка.Склад как склад,
		|	Док_Товар.КоличествоФакт
		|ИЗ
		|	"+ИмяДок+".Товар КАК Док_Товар
		|Где Док_Товар.Ссылка=&Док";
	КонецЕсли;	
	Запрос=Новый Запрос;
	Запрос.Текст=ТХТ;
	Запрос.УстановитьПараметр("Док",Док);	
	Попытка
		ТЗ=Запрос.Выполнить().Выгрузить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Для каждого Стр из ТЗ Цикл
		Если ПартияСтарая = "ПартияСтарая" Тогда
			ОМ15_ДобавитьСтрокуРезерваПодбора  (Стр.ТоварСтарый,Стр.ПартияСтарая,Стр.Склад,Стр.КоличествоФакт,Док);	
		Иначе
			ОМ15_ДобавитьСтрокуРезерваПодбора  (Стр.Товар,Стр.Партия,Стр.Склад,Стр.КоличествоФакт,Док);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	//ОМ15_ДобавитьДокументЦеликомВРезервПодбора
//==========================================================GtG====
